package Examclouds_com;
/** Создать массив типа double с размером 4.
    Записать в него любые значения с помощью блока для инициализации.
    Вывести на консоль значение первого элемента**/
public class ArrayDemo2 {
    public static void main(String[] args) {
        double[] numbers = {1.5, 2.8, 3.2, 4.7};

        double firstNumber = numbers[0];
        System.out.println("Первый элемент массива: " + firstNumber);
    }
}
